#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьКодДоступа()
	
	УстановитьКодДоступаСкрытый();
	
	Элементы.ДекорацияОшибка.Заголовок = "";
	Если КодДоступа = ВводимыйКодДоступа Тогда
		Закрыть(Истина);
	ИначеЕсли СтрДлина(ВводимыйКодДоступа) = 4 Тогда
		Элементы.ДекорацияОшибка.Заголовок = НСтр("ru='Неверный код доступа!';en='Invalid access code!'");
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьКодДоступа", 0.5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКодДоступаСкрытый()
	
	КодДоступаСкрытый = "○○○○";
	
	Если СтрДлина(ВводимыйКодДоступа) = 0 Тогда
		КодДоступаСкрытый = "○○○○";
	ИначеЕсли СтрДлина(ВводимыйКодДоступа) = 1 Тогда
		КодДоступаСкрытый = "●○○○";
	ИначеЕсли СтрДлина(ВводимыйКодДоступа) = 2 Тогда
		КодДоступаСкрытый = "●●○○";
	ИначеЕсли СтрДлина(ВводимыйКодДоступа) = 3 Тогда
		КодДоступаСкрытый = "●●●○";
	ИначеЕсли СтрДлина(ВводимыйКодДоступа) = 4 Тогда
		КодДоступаСкрытый = "●●●●";
	КонецЕсли;
	
	Элементы.ДекорацияКодДоступа.Заголовок = КодДоступаСкрытый;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьКодДоступа()
	
	ВводимыйКодДоступа = "";
	УстановитьКодДоступаСкрытый();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодДоступа = Константы.КодДоступа.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	УстановитьКодДоступаСкрытый();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка1Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "1";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка2Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "2";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка3Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "3";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка4Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "4";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка5Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "5";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка6Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "6";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка7Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "7";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка8Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "8";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка9Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "9";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтменаНажатие(Элемент)
	
	Закрыть(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Кнопка0Нажатие(Элемент)
	
	ВводимыйКодДоступа = ВводимыйКодДоступа + "0";
	ПроверитьКодДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаУдалитьНажатие(Элемент)
	
	ДлинаВводимыйКодДоступаа = СтрДлина(ВводимыйКодДоступа);
	ВводимыйКодДоступа = Лев(ВводимыйКодДоступа, ДлинаВводимыйКодДоступаа - 1);
	ПроверитьКодДоступа();
	
КонецПроцедуры

#КонецОбласти