
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РаботатьАвтономно(Команда)
	
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("РежимРаботыВыбран", Истина);
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ИспользоватьСинхронизациюДанных", Ложь);
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьсяКСервису(Команда)
	
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("РежимРаботыВыбран", Истина);
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ИспользоватьСинхронизациюДанных", Истина);
	Закрыть(Истина);
	ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизации");
	
КонецПроцедуры

#КонецОбласти