#Область СлужебныйПрограммныйИнтерфейс

// Выполняет синхронизацию с центральной базой.
//
Процедура Синхронизировать() Экспорт
	
	Если ОбменМобильноеПриложениеВызовСервера.ОбменВключен() Тогда
		Если ОбменМобильноеПриложениеВызовСервера.ВходВЦентральнуюБазуВыполнен() Тогда
			ОткрытьФорму("ОбщаяФорма.Синхронизация");
		Иначе
			ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизации");
		КонецЕсли;
	Иначе
		ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("РежимРаботыВыбран", Истина);
		ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ИспользоватьСинхронизациюДанных", Истина);
		ОткрытьФорму("ОбщаяФорма.НастройкиСинхронизации");
	КонецЕсли;
	
КонецПроцедуры // Синхронизировать

#КонецОбласти
