
&НаКлиенте
Процедура Обновить(Команда)
	
	Подключаемый_ОбновитьСписокПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания(
		"Подключаемый_ОбновитьСписокПользователей", 0.5, Истина
	);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСписокПользователей()
	
	СообщениеОбОшибке = "";
	ОбновитьСписокПользователейНаСервере(СообщениеОбОшибке);
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		ЭтаФорма.Доступность = Ложь;
		Элементы.Список.Видимость = Ложь;
		Предупреждение(СообщениеОбОшибке);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПользователейНаСервере(СообщениеОбОшибке)
	
	УстановитьПривилегированныйРежим(Истина);
	СоединениеСЦБУстановлено = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("СоединениеСЦБУстановлено");
	
	Если НЕ СоединениеСЦБУстановлено Тогда
		Возврат;
	КонецЕсли;
	Справочники.Пользователи.ОбновитьСписокПользователейССервера(СообщениеОбОшибке);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания(
		"Подключаемый_ОбновитьСписокПользователей", 0.5, Истина
	);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ОбменМобильноеПриложениеВызовСервера.ЕстьПолныеПрава() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

