Функция ЕстьЭлементыПоОтбору(ОтборПоГруппе = Неопределено, ОтборПоНаименованию = "", ОтбиратьГруппы = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ОтборПоГруппе) Тогда
		ВыборкаСправочника = Справочники.Контрагенты.Выбрать(ОтборПоГруппе);
	Иначе
		ВыборкаСправочника = Справочники.Контрагенты.Выбрать();
	КонецЕсли;
	
	Пока ВыборкаСправочника.Следующий() Цикл
		Если НЕ ВыборкаСправочника.ПометкаУдаления
			И ВыборкаСправочника.ЭтоГруппа = ОтбиратьГруппы
			И (ПустаяСтрока(ОтборПоНаименованию) ИЛИ Найти(НРег(ВыборкаСправочника.Наименование), НРег(ОтборПоНаименованию)) > 0) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции