
&НаКлиенте
Процедура ОставитьОтзыв(Команда)
	
	ОткрытьФормуМодально("ОбщаяФорма.ОставитьОтзыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьИнструкцию(Команда)
	
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/Wiki");
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьFAQ(Команда)
	
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/FAQ");
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьНаФорум(Команда)
	
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/prof-it-med-agents/boards/2");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьБазуРазработчикам(Команда)
	
	СисИнфо = Новый СистемнаяИнформация;
	
	ТемаПисьма = НСтр("ru='Выгрузка информационной базы для анализа проблемы';en='Base'");
	ТелоПисьма = 
		""
		+ Символы.ПС
		+ Символы.ПС
		+ "---"
		+ Символы.ПС
		+  НСтр("ru='Сформировано в мобильном приложении ПРОФ-ИТ:мед.представители';en='Created in a mobile application PROF-IT:Med.agents'")
		+ Символы.ПС
		+ ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ТекущаяВерсияПриложения") + "|" + СисИнфо.ВерсияОС + ?(ЗначениеЗаполнено(СисИнфо.ТипПлатформы), "|" + СисИнфо.ТипПлатформы, "") 
	;
		
	ВыгрузкаБазы = ОтправитьБазуРазработчикамНаСервере();
	
	#Если МобильноеПриложениеКлиент Тогда
	ОбщегоНазначенияКлиент.ПослатьПисьмо(
		"helpdesk@prof-it.ru", 
		ТемаПисьма, 
		ТелоПисьма, 
		ВыгрузкаБазы, 
		НСтр("ru='выгрузка базы.xml';en='base.xml'")
	);
	#Иначе
	ВвестиСтроку(
		ВыгрузкаБазы + ТелоПисьма,
		ТемаПисьма,
		,
		Истина
	);
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ОтправитьБазуРазработчикамНаСервере()
	
	Возврат РезервноеКопирование.ВыгрузитьБазуВXML();
	
КонецФункции