#Область ВспомогательныеПроцедурыИФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Параметры.Период;
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	
	Если ЗначениеЗаполнено(Период) Тогда
		Элементы.НачалоПериода.Доступность = Ложь;
		Элементы.КонецПериода.Доступность = Ложь;
	Иначе
		Элементы.НачалоПериода.Доступность = Истина;
		Элементы.КонецПериода.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Период) Тогда
		НачалоПериода = Период.ДатаНачала;
		КонецПериода = Период.ДатаОкончания;
		Элементы.НачалоПериода.Доступность = Ложь;
		Элементы.КонецПериода.Доступность = Ложь;
	Иначе
		НачалоПериода = Неопределено;
		КонецПериода = Неопределено;
		Элементы.НачалоПериода.Доступность = Истина;
		Элементы.КонецПериода.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонецПериода(Команда)
	
	ВвестиДату(КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериода(Команда)
	
	ВвестиДату(НачалоПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("НачалоПериода", НачалоПериода);
	СтруктураРеквизитовФормы.Вставить("КонецПериода", КонецПериода);
	СтруктураРеквизитовФормы.Вставить("Период", Период);
	
	Закрыть(СтруктураРеквизитовФормы);
	
КонецПроцедуры

#КонецОбласти


