
#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьКонстанты(НазваниеБазы, Путь)
	
	Константы.НаименованиеЦентральнойБазы.Установить(НазваниеБазы);
	Константы.АдресЦентральнойБазы.Установить(Путь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокБазПользователяФреша(Имя, Пароль, ФильтрБаз = "")
	
	Результат = "";
	Соединение = Новый HTTPСоединение("1cfresh.com", 443, Имя, Пароль,,, Новый ЗащищенноеСоединениеOpenSSL);
	
	Попытка
		Запрос = Новый HTTPЗапрос("/a/wcib-private/hs/WebCommonInfoBases/GetInfoBases?ClientID=00000000-0000-0000-0000-000000000000&InfoBasesCheckCode=00000000-0000-0000-0000-000000000000");
		Ответ = Соединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			Результат = Ответ.ПолучитьТелоКакСтроку();
			МассивВозврата = Новый Массив();
		ИначеЕсли  Ответ.КодСостояния = 401 Тогда
			МассивВозврата = "1";
		Иначе
			МассивВозврата = "2";
		КонецЕсли;
		
		ПозицияРазделителя = Найти(Результат, "[");
		Пока ПозицияРазделителя > 0 Цикл
			
			Результат = Сред(Результат, ПозицияРазделителя + 1);
			ПозицияРазделителя2 = Найти(Результат, "]");
			НазваниеБазы = Лев(Результат, ПозицияРазделителя2 - 1);
			ПозицияРазделителя = Найти(Результат, "[");
			
			ПозицияРазделителя3 = Найти(Результат, "Connect=ws=\");
			
			Если ПозицияРазделителя3 < ПозицияРазделителя Тогда
				ПозицияРазделителя4 = Найти(Результат, ";\n");
				ПутьКБазе = Сред(Результат, ПозицияРазделителя3 + 13, ПозицияРазделителя4 - 2 - (ПозицияРазделителя3 + 13));
				ПутьКБазе = СтрЗаменить(ПутьКБазе, "\/", "/");
			Иначе
				ПутьКБазе = ПутьКБазе;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ПутьКБазе) И (ПустаяСтрока(ФильтрБаз) ИЛИ Найти(ПутьКБазе, ФильтрБаз) > 0) Тогда
				МассивВозврата.Добавить(Новый Структура("НазваниеБазы, Путь", НазваниеБазы, ПутьКБазе));
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		МассивВозврата = "2";
	КонецПопытки;
	
	Возврат МассивВозврата;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивИБ = ПолучитьСписокБазПользователяФреша(
		Константы.ПользовательЦентральнойБазы.Получить(),
		Константы.Пароль.Получить(),
		"sbm"
	);
	
	Если ТипЗнч(МассивИБ) = Тип("Строка") Тогда
		ТекстЗакрытия = МассивИБ;
	Иначе
		Если МассивИБ.Количество() = 1 Тогда // Если база всего одна выбирать ничего не нужно.
			ЗаписатьКонстанты(МассивИБ[0].НазваниеБазы, МассивИБ[0].Путь);
			ТекстЗакрытия = МассивИБ[0].НазваниеБазы;
		Иначе
			Для каждого ТекЭлемент Из МассивИБ Цикл
				НоваяСтрока = Базы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекЭлемент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ПустаяСтрока(ТекстЗакрытия) Тогда
		Закрыть(ТекстЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура БазыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗаписатьКонстанты(Базы[ВыбраннаяСтрока].НазваниеБазы, Базы[ВыбраннаяСтрока].Путь);
	Закрыть(Базы[ВыбраннаяСтрока].НазваниеБазы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти