#Область ОбщегоНазначения

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	АвтоЗаголовок = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Заголовок = НСтр("ru='Товар (новый)';en='Item (new)'");
	ИначеЕсли Объект.ПометкаУдаления Тогда
		ЭтаФорма.Заголовок = НСтр("ru='Товар (к удалению)';en='Item (removed)'");
	Иначе
		ЭтаФорма.Заголовок = НСтр("ru='Товар';en='Item'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормы();
	
	ЭтоМногопользовательскийРежим = ОбменМобильноеПриложениеВызовСервера.ЭтоМногопользовательскийРежим();
			
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Функция ПоместитьФайлВХранилище(Знач ПутьКФайлу, Знач ИдентификаторФормы) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ФайлПомещенВХранилище", Ложь);
	
	Файл = Новый Файл(ПутьКФайлу);
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПутьКФайлу));
	ПомещенныеФайлы = Новый Массив;
	
	Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Ошибка при помещении файла"
		"""%1"""
		"во временное хранилище.';en='Error when putting files"
		"""% 1"""
		"to temporary storage.'"),
		ПутьКФайлу) );
		Возврат Результат;
	КонецЕсли;
	
	Результат.Вставить("ФайлПомещенВХранилище", Истина);
	Результат.Вставить("ДатаМодификацииУниверсальная",   Файл.ПолучитьУниверсальноеВремяИзменения());
	Результат.Вставить("АдресФайлаВоВременномХранилище", ПомещенныеФайлы[0].Хранение);
	Результат.Вставить("Расширение",                     Прав(Файл.Расширение, СтрДлина(Файл.Расширение)-1));
	Результат.Вставить("Имя", Файл.Имя);
	Результат.Вставить("ИмяБезРасширения", Файл.ИмяБезРасширения);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтсканироватьШтрихкод(Команда)
	
	ОбщегоНазначенияКлиент.ОтсканироватьШтрихкод(Новый ОписаниеОповещения("ОбработатьШтрихкод", ЭтаФорма), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученШтрихкод(Штрихкод) Экспорт
	
	ОбработатьШтрихкод(Штрихкод, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод, Результат, Сообщение = "", ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат Тогда
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		Номенклатура = ОбщегоНазначенияСервер.ПолучитьноменклатуруПоШтрихкоду(Штрихкод);
		Если НЕ Значениезаполнено(Номенклатура) ИЛИ Номенклатура = Объект.Ссылка Тогда
			Объект.Штрихкод = Штрихкод;
			Модифицированность = Истина;
			ОбновитьОтображениеДанных();
		Иначе
			ПоказатьВопросОткрытьНоменклатуру(Номенклатура);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	
	Номенклатура = ОбщегоНазначенияСервер.ПолучитьноменклатуруПоШтрихкоду(Объект.Штрихкод);
	Если НЕ Значениезаполнено(Номенклатура)
		ИЛИ Номенклатура = Объект.Ссылка Тогда
	Иначе
		Объект.Штрихкод = "";
		ПоказатьВопросОткрытьНоменклатуру(Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОткрытьНоменклатуру(Номенклатура) Экспорт
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(НСтр("ru='Открыть';en='Open'"));
	СписокКнопок.Добавить(НСтр("ru='Отмена';en='Cancel'"));
	Ответ = Вопрос(НСтр("ru='Этот штрихкод уже присвоен номенклатуре ""';en='This bar code is already assigned to the nomenclature ""'") + Номенклатура + НСтр("ru='"". Открыть?';en='"". Open?'"), СписокКнопок);
	Если Ответ = НСтр("ru='Открыть';en='Open'") Тогда
		ОткрытьЗначение(Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	//!
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/Wiki");
	
КонецПроцедуры


