
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПоказатьНеСпрашивать") Тогда
		Элементы.ГруппаНеСпрашивать.Видимость = Истина;
	Иначе
		Элементы.ГруппаНеСпрашивать.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценитьПозднее(Команда)
	
	Если НеСпрашивать Тогда
		Предупреждение(НСтр("ru='Оценить приложение можно в главном меню.';en='Rate app from the main menu'"));
		ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("СчетчикОткрытияФормыОценкиПриложения", -1);
	Иначе
		ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("СчетчикОткрытияФормыОценкиПриложения", 0);
	КонецЕсли;
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("СчетчикОткрытияФормыОценкиПриложения", -1);
	
	Если ОбщегоНазначенияВызовСервера.ВерсияОС() = "iOS" Тогда
		//ЗапуститьПриложение("itms-apps://itunes.apple.com/us/app/1s-unf/id590223043&mt=8");
	Иначе
		ЗапуститьПриложение("market://details?id=com.profit60.mobilemedagents");
	КонецЕсли;

	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("СчетчикОткрытияФормыОценкиПриложения", -1);
	
	СисИнфо = Новый СистемнаяИнформация;
	
	ПисьмоКонтрагенту = Новый Структура;
	ПисьмоКонтрагенту.Вставить("ТемаПисьма", НСтр("ru='Отзыв о мобильном МП';en='Message from MA'"));
	ТелоПисьма = 
		""
		+ Символы.ПС
		+ Символы.ПС
		+ "---"
		+ Символы.ПС
		+  НСтр("ru='Сформировано в мобильном приложении ПРОФ-ИТ:мед.представители';en='Created in a mobile application PROF-IT:Med.agents'")
		+ Символы.ПС
		+ ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ТекущаяВерсияПриложения") + "|" + СисИнфо.ВерсияОС + ?(ЗначениеЗаполнено(СисИнфо.ТипПлатформы), "|" + СисИнфо.ТипПлатформы, "") 
	;
	ПисьмоКонтрагенту.Вставить("ТелоПисьма", ТелоПисьма);
	ПисьмоКонтрагенту.Вставить("Получатель", "helpdesk@prof-it.ru");
	
	ОбщегоНазначенияКлиент.ОтправитьПоПочте(ПисьмоКонтрагенту);
	
	Закрыть();
	
КонецПроцедуры
